<template>
  <div>
    <h2>🎈 v-if vs v-show</h2>
    <!-- 🟢 2. 차이점 
     🎬 v-if 아예 HTML에서 없애버렸다가 다시 넣어줘요. 
     즉, 진짜로 사라졌다가 다시 나타남. 
     무거운 기능이라 잘 안 쓰는 경우에는 성능이 좋아요. 
    👉 예시: 로그인 한 사람만 메뉴 보이기 
    🎭 v-show HTML에 계속 있지만, display: none
    으로 숨기는 것뿐이에요. 즉, 안 보일 뿐 실제로는 자리 차지하고 있음. 
    자주 보여줬다/숨겼다 해야 할 때 빠르고 편해요.
    👉 예시: 탭 메뉴, 자주 켰다 껐다 하는 팝업 -->
    <!-- v-if -->
    <p v-if="isLogin">✅ 로그인 했어요 (v-if)</p>

    <!-- v-show -->
    <p v-show="isLogin">✅ 로그인 했어요 (v-show)</p>

    <button @click="isLogin = !isLogin">상태 바꾸기</button>
  </div>
</template>

<script setup>
import { ref } from "vue";
const isLogin = ref(false);
</script>
